Revit 2027 API
FamilyThermalProperties.ThermalTransmittance Property
 The thermal transmittance value (U-Value). The unit is Watt per meter-squared Kelvin (W/(m^2*K)).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalTransmittance { get; }
Public ReadOnly Property ThermalTransmittance As Double
	Get
public:
property double ThermalTransmittance {
	double get ();
}
member ThermalTransmittance : float with get
Property Value
Double
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace